import cv2
import numpy as np
from PIL import Image

# 加载图片
image_path = '/media/jnu/SUCCESS/data_7_5/hanzi_1/prvamp/yuce/'  # 替换为你的图片路径
for idx in range(1, 6):
    path = ('%s/%d.png' % (image_path, idx))
    image = Image.open(path)
    # 将图片转换为NumPy数组
    image_array = np.array(image)

    # 计算平均强度
    average_intensity = np.mean(image_array)
    print("第",idx,"张图片的平均强度是",average_intensity)


#255
#net:2.6408843994140625
#net:13.232131958007812         1377.05
#matlab 58.34416198730469       983.8064

#128
#net:18.90  368.84
#matlab  58.47    982.61

# 0
#net 132.93191528320312

# 200
# net  5.92


'''
整个图片的平均强度
net 33.928955078125
prvamp 29.231979370117188
duli_net 21.007186889648438
dulinet 




quyu
net
第 1 张图片的平均强度是 22.237060546875
第 2 张图片的平均强度是 21.561492919921875
第 3 张图片的平均强度是 20.975112915039062
第 4 张图片的平均强度是 20.045303344726562
第 5 张图片的平均强度是 21.951187133789062

duli_net

第 1 张图片的平均强度是 21.2972412109375
第 2 张图片的平均强度是 20.905471801757812
第 3 张图片的平均强度是 20.664886474609375
第 4 张图片的平均强度是 24.405609130859375
第 5 张图片的平均强度是 22.9661865234375

prvamp
第 1 张图片的平均强度是 36.3046875
第 2 张图片的平均强度是 27.598876953125
第 3 张图片的平均强度是 29.106613159179688
第 4 张图片的平均强度是 34.12541198730469
第 5 张图片的平均强度是 33.25926208496094
'''

